app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM `comments`

  def show
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  def new
    @comment = Comment.new
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 2)

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`name`, `updated_at`, `body`, `post_id`, `created_at`) VALUES('Krish', '2012-05-27 13:48:02', 'Yes, he is innocent guy........', NULL, '2012-05-27 13:48:02')