app/controllers/parts_controller.rb

  def add_part
    post_id = params[:post_id]
    @post = post_id.blank? ? Post.new : Post.find(post_id)
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 2)