app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM `posts`

  def create
    @post = Post.new(params[:post])
    @post.save(false)
    @post.create_or_update_parts(params["body"])
---
INSERT INTO `posts` (`updated_at`, `title`, `created_at`) VALUES('2012-05-26 18:29:56', NULL, '2012-05-26 18:29:56')
INSERT INTO `parts` (`updated_at`, `body`, `post_id`, `created_at`) VALUES('2012-05-27 11:01:06', 'vvbvbdfgdfgdf', NULL, '2012-05-27 11:01:06')

  def update
    @post = Post.find(params[:id])
    @post.create_or_update_parts(params["body"])
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
INSERT INTO `parts` (`updated_at`, `body`, `post_id`, `created_at`) VALUES('2012-05-27 11:29:23', 'This is part2', 2, '2012-05-27 11:29:23')
UPDATE `parts` SET `body` = 'This is part1', `updated_at` = '2012-05-27 11:29:23' WHERE `id` = 2